/*
הכלל קובע שבכל מאפיין באובייקט המפתח תמיד יהיה מחרוזת, והערך יכול להיות מכל טיפוס
לכן, מותר לרשום עבור המפתח ערך מחרוזתי ללא מרכות, ועדיין הערך יחשב למחרוזת


אם כן, כיצד נוכל לשתול בתור מפתח ערך דינמי - לדוגמא ערך של משתנה
נשתמש בסימן []  להראות שמדובר בערך דינמי ולא מחרוזתי
*/


var myKey="age";
var myValue=12;

var obj1={
    "name":"Bob",
     myKey:myValue
};

console.log(obj1);  //--> { name: 'Bob', myKey: 12 }


var obj2={
    "name":"Bob",
    [myKey]:myValue
};

console.log(obj2);  //--> { name: 'Bob', age: 12 }



